; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-6-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p0-10 - location
	p0-12 - location
	p1-4 - location
	p2-0 - location
	p2-6 - location
	p2-12 - location
	p3-13 - location
	p4-3 - location
	p4-6 - location
	p4-7 - location
	p5-1 - location
	p5-6 - location
	p5-9 - location
	p7-6 - location
	p7-14 - location
	p9-0 - location
	p10-8 - location
	p10-14 - location
	p11-8 - location
	p12-3 - location
	p12-8 - location
	p12-9 - location
	p13-2 - location
	p14-8 - location
	p14-11 - location
	p14-12 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s3)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s8)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s12)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s7)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s8)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s10)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s4)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s9)
	(at package2 s2)
	(at package3 s6)
	(path s0 p0-10)
	(path p0-10 s0)
	(path s10 p0-10)
	(path p0-10 s10)
	(path s0 p0-12)
	(path p0-12 s0)
	(path s12 p0-12)
	(path p0-12 s12)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(path s3 p3-13)
	(path p3-13 s3)
	(path s13 p3-13)
	(path p3-13 s13)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s7 p7-14)
	(path p7-14 s7)
	(path s14 p7-14)
	(path p7-14 s14)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(path s10 p10-14)
	(path p10-14 s10)
	(path s14 p10-14)
	(path p10-14 s14)
	(path s11 p11-8)
	(path p11-8 s11)
	(path s8 p11-8)
	(path p11-8 s8)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(path s12 p12-9)
	(path p12-9 s12)
	(path s9 p12-9)
	(path p12-9 s9)
	(path s13 p13-2)
	(path p13-2 s13)
	(path s2 p13-2)
	(path p13-2 s2)
	(path s14 p14-8)
	(path p14-8 s14)
	(path s8 p14-8)
	(path p14-8 s8)
	(path s14 p14-11)
	(path p14-11 s14)
	(path s11 p14-11)
	(path p14-11 s11)
	(path s14 p14-12)
	(path p14-12 s14)
	(path s12 p14-12)
	(path p14-12 s12)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 71)
	(= (time-to-drive s4 s0) 71)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 27)
	(= (time-to-drive s11 s0) 27)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 21)
	(= (time-to-drive s0 s1) 21)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 87)
	(= (time-to-drive s2 s1) 87)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 65)
	(= (time-to-drive s9 s1) 65)
	(link s1 s13)
	(link s13 s1)
	(= (time-to-drive s1 s13) 51)
	(= (time-to-drive s13 s1) 51)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 54)
	(= (time-to-drive s10 s2) 54)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 47)
	(= (time-to-drive s11 s2) 47)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 55)
	(= (time-to-drive s5 s3) 55)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 88)
	(= (time-to-drive s9 s3) 88)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 62)
	(= (time-to-drive s10 s3) 62)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 89)
	(= (time-to-drive s1 s4) 89)
	(link s4 s13)
	(link s13 s4)
	(= (time-to-drive s4 s13) 74)
	(= (time-to-drive s13 s4) 74)
	(link s4 s14)
	(link s14 s4)
	(= (time-to-drive s4 s14) 61)
	(= (time-to-drive s14 s4) 61)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 93)
	(= (time-to-drive s12 s5) 93)
	(link s5 s13)
	(link s13 s5)
	(= (time-to-drive s5 s13) 5)
	(= (time-to-drive s13 s5) 5)
	(link s5 s14)
	(link s14 s5)
	(= (time-to-drive s5 s14) 47)
	(= (time-to-drive s14 s5) 47)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 49)
	(= (time-to-drive s0 s6) 49)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 21)
	(= (time-to-drive s5 s6) 21)
	(link s6 s13)
	(link s13 s6)
	(= (time-to-drive s6 s13) 44)
	(= (time-to-drive s13 s6) 44)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 8)
	(= (time-to-drive s1 s7) 8)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 2)
	(= (time-to-drive s4 s7) 2)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 15)
	(= (time-to-drive s5 s7) 15)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 26)
	(= (time-to-drive s9 s7) 26)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 9)
	(= (time-to-drive s11 s7) 9)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 28)
	(= (time-to-drive s1 s8) 28)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 72)
	(= (time-to-drive s5 s8) 72)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 20)
	(= (time-to-drive s7 s8) 20)
	(link s8 s12)
	(link s12 s8)
	(= (time-to-drive s8 s12) 90)
	(= (time-to-drive s12 s8) 90)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 76)
	(= (time-to-drive s4 s9) 76)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 62)
	(= (time-to-drive s6 s9) 62)
	(link s9 s14)
	(link s14 s9)
	(= (time-to-drive s9 s14) 61)
	(= (time-to-drive s14 s9) 61)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 3)
	(= (time-to-drive s0 s10) 3)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 83)
	(= (time-to-drive s6 s10) 83)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 47)
	(= (time-to-drive s9 s10) 47)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 68)
	(= (time-to-drive s12 s10) 68)
	(link s11 s5)
	(link s5 s11)
	(= (time-to-drive s11 s5) 33)
	(= (time-to-drive s5 s11) 33)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 1)
	(= (time-to-drive s10 s11) 1)
	(link s12 s0)
	(link s0 s12)
	(= (time-to-drive s12 s0) 14)
	(= (time-to-drive s0 s12) 14)
	(link s12 s1)
	(link s1 s12)
	(= (time-to-drive s12 s1) 88)
	(= (time-to-drive s1 s12) 88)
	(link s13 s0)
	(link s0 s13)
	(= (time-to-drive s13 s0) 89)
	(= (time-to-drive s0 s13) 89)
	(link s13 s10)
	(link s10 s13)
	(= (time-to-drive s13 s10) 75)
	(= (time-to-drive s10 s13) 75)
	(link s14 s3)
	(link s3 s14)
	(= (time-to-drive s14 s3) 76)
	(= (time-to-drive s3 s14) 76)
	(link s14 s8)
	(link s8 s14)
	(= (time-to-drive s14 s8) 62)
	(= (time-to-drive s8 s14) 62)
	(link s14 s10)
	(link s10 s14)
	(= (time-to-drive s14 s10) 35)
	(= (time-to-drive s10 s14) 35)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s8)
	(at driver2 s6)
	(at driver4 s2)
	(at driver5 s12)
	(at truck3 s11)
	(at truck4 s9)
	(at truck6 s4)
	(at package1 s7)
	(at package2 s7)
	(at package3 s11)
	))

(:metric minimize (+ (* 3 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s7)
   deleted: (at driver1 s7) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 10
2. (drive-truck truck3 s7 s9 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   changed: (fuel-used) from 0 to 260
   goals met: 1 of 10
3. (drive-truck truck3 s9 s10 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s10)
   changed: (fuel-used) from 260 to 730
   goals met: 1 of 10
4. (board-truck driver5 truck4 s8)
   deleted: (at driver5 s8) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 1 of 10
5. (drive-truck truck4 s8 s12 driver5)
   deleted: (at truck4 s8)
   added: (at truck4 s12)
   changed: (fuel-used) from 730 to 1630
   goals met: 1 of 10
6. (disembark-truck driver5 truck4 s12)
   deleted: (driving driver5 truck4)
   added: (at driver5 s12) (empty truck4)
   goals met: 2 of 10
7. (drive-truck truck3 s10 s9 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s9)
   changed: (fuel-used) from 1630 to 2100
   goals met: 2 of 10
8. (load-truck package1 truck3 s9)
   deleted: (at package1 s9)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 2 of 10
9. (drive-truck truck3 s9 s10 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s10)
   changed: (fuel-used) from 2100 to 2617
   goals met: 2 of 10
10. (board-truck driver5 truck4 s12)
   deleted: (at driver5 s12) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 1 of 10
11. (drive-truck truck3 s10 s2 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s2)
   changed: (fuel-used) from 2617 to 3211
   goals met: 1 of 10
12. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 1 of 10
13. (drive-truck truck3 s2 s11 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s11)
   changed: (fuel-used) from 3211 to 3822
   goals met: 2 of 10
14. (walk driver2 s3 p4-3)
   deleted: (at driver2 s3)
   added: (at driver2 p4-3)
   goals met: 2 of 10
15. (walk driver2 p4-3 s4)
   deleted: (at driver2 p4-3)
   added: (at driver2 s4)
   goals met: 2 of 10
16. (walk driver2 s4 p4-6)
   deleted: (at driver2 s4)
   added: (at driver2 p4-6)
   goals met: 2 of 10
17. (walk driver2 p4-6 s6)
   deleted: (at driver2 p4-6)
   added: (at driver2 s6)
   goals met: 3 of 10
18. (drive-truck truck3 s11 s7 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s7)
   changed: (fuel-used) from 3822 to 3939
   goals met: 2 of 10
19. (unload-truck package1 truck3 s7)
   deleted: (in package1 truck3)
   added: (at package1 s7)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 3 of 10
20. (unload-truck package2 truck3 s7)
   deleted: (in package2 truck3)
   added: (at package2 s7)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 4 of 10
21. (walk driver4 s3 p3-13)
   deleted: (at driver4 s3)
   added: (at driver4 p3-13)
   goals met: 4 of 10
22. (walk driver4 p3-13 s13)
   deleted: (at driver4 p3-13)
   added: (at driver4 s13)
   goals met: 4 of 10
23. (walk driver4 s13 p13-2)
   deleted: (at driver4 s13)
   added: (at driver4 p13-2)
   goals met: 4 of 10
24. (drive-truck truck3 s7 s5 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (fuel-used) from 3939 to 4089
   goals met: 4 of 10
25. (walk driver4 p13-2 s2)
   deleted: (at driver4 p13-2)
   added: (at driver4 s2)
   goals met: 5 of 10
26. (drive-truck truck3 s5 s6 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 4089 to 4299
   goals met: 5 of 10
27. (load-truck package3 truck3 s6)
   deleted: (at package3 s6)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 10
28. (drive-truck truck3 s6 s5 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 4299 to 4530
   goals met: 5 of 10
29. (drive-truck truck3 s5 s11 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s11)
   changed: (fuel-used) from 4530 to 4893
   goals met: 6 of 10
30. (unload-truck package3 truck3 s11)
   deleted: (in package3 truck3)
   added: (at package3 s11)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 10
31. (disembark-truck driver1 truck3 s11)
   deleted: (driving driver1 truck3)
   added: (at driver1 s11) (empty truck3)
   goals met: 7 of 10
32. (walk driver1 s11 p11-8)
   deleted: (at driver1 s11)
   added: (at driver1 p11-8)
   goals met: 7 of 10
33. (drive-truck truck4 s12 s1 driver5)
   deleted: (at truck4 s12)
   added: (at truck4 s1)
   changed: (fuel-used) from 4893 to 5773
   goals met: 7 of 10
34. (drive-truck truck4 s1 s9 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s9)
   changed: (fuel-used) from 5773 to 6423
   goals met: 8 of 10
35. (disembark-truck driver5 truck4 s9)
   deleted: (driving driver5 truck4)
   added: (at driver5 s9) (empty truck4)
   goals met: 8 of 10
36. (walk driver1 p11-8 s8)
   deleted: (at driver1 p11-8)
   added: (at driver1 s8)
   goals met: 9 of 10
37. (walk driver5 s9 p12-9)
   deleted: (at driver5 s9)
   added: (at driver5 p12-9)
   goals met: 9 of 10
38. (walk driver5 p12-9 s12)
   deleted: (at driver5 p12-9)
   added: (at driver5 s12)
   goals met: 10 of 10
